app/controllers/articles_controller.rb

UPDATE "articles" SET "title" = ?, "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["title", nil], ["description", nil], ["updated_at", "2019-04-30 00:29:34.341621"], ["id", 1]]
---
  def update
    @article.update(title: params[:article][:title], description: params[:article][:description])

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "My article title"], ["description", "My article description"], ["created_at", "2019-04-30 00:29:34.304360"], ["updated_at", "2019-04-30 00:29:34.304360"]]
---
  def create
    @article = Article.create(title: params[:title], description: params[:description])